Pandas

Series are used to work with one dimensional array, whereas DataFrame can be used with two dimensional arrays. DataFrame has two different index i.e.column-index and row-index.

In [12]:
import pandas as pd

#converting tuple to series
tuple_data = ('aasai',23,'Engineer','Korea')
series = pd.Series(tuple_data,index=['name','age','profession','Loaction'])
print(series)
type(series)

name             aasai
age                 23
profession    Engineer
Loaction         Korea
dtype: object

pandas.core.series.Series

In [6]:
#converting dictionary to series

dict_data = {'name':'aasai','age':23,'Profession':'Engineer','Location':'Korea'}
series = pd.Series(dict_data)
print(series)
type(series)

name             aasai
age                 23
Profession    Engineer
Location         Korea
dtype: object

pandas.core.series.Series

In [29]:
#Elements of the Series can be accessed using index name e.g. f[‘shares’] or f[0]

dict_data['name']
tuple_data[0]

'aasai'

In [32]:
data = {'name':['aasai','praveen','nanda'],
       'age':[23,23,23],
       'Profession':['Engineer','Engineer','Engineer'],
       'native':['Coimbatore','Mayavaram','Thiruvallur']
       }
Data_frame = pd.DataFrame(data,index=['one','two','three'])
print(Data_frame)

          name  age Profession       native
one      aasai   23   Engineer   Coimbatore
two    praveen   23   Engineer    Mayavaram
three    nanda   23   Engineer  Thiruvallur

In [33]:
type(Data_frame)

pandas.core.frame.DataFrame

In [35]:
#Added Additional Column
Data_frame['country'] = ['India','India','India']
print(Data_frame)

          name  age Profession       native country
one      aasai   23   Engineer   Coimbatore   India
two    praveen   23   Engineer    Mayavaram   India
three    nanda   23   Engineer  Thiruvallur   India

In [46]:
#.loc for label based indexing or
#.iloc for positional indexing
Data_frame.loc['one']
Data_frame.iloc[0]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [53]:
#All rows and first column access
Data_frame.iloc[:,0]
Data_frame.loc[:,'name']

one        aasai
two      praveen
three      nanda
Name: name, dtype: object

In [49]:
#All column and First row access
Data_frame.iloc[0,:]
Data_frame.loc['one',:]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [57]:
#Access first row and third column syntax for accessing specific data
Data_frame.iloc[0,2]
#output : Engineer
Data_frame.loc['one','age']

23

In [58]:
#delete Profession column usingg del command
del Data_frame['Profession']
Data_frame

          name  age       native country
one      aasai   23   Coimbatore   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [80]:
#Replace Aasai native to madurai using replace
Data_frame.replace(to_replace = 'Coimbatore',value = 'Madurai')
#Replace using location
Data_frame.loc['one','native'] = 'Madurai'
Data_frame

          name  age       native country
one      aasai   23      Madurai   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [88]:
#Creating a Series by passing a list of values and set index by series of date
series = pd.Series(['one','Two','Three'],index = pd.date_range('20191101',periods=3))
series

2019-11-01      one
2019-11-02      Two
2019-11-03    Three
Freq: D, dtype: object

In [112]:
#create dataframe using numpy
import numpy as np
data_frame = pd.DataFrame(np.random.randint(1,10,size=(6,4)),index = pd.date_range('20191101',periods = 6))
data_frame

            0  1  2  3
2019-11-01  1  4  9  9
2019-11-02  2  2  6  5
2019-11-03  7  5  7  3
2019-11-04  4  2  1  9
2019-11-05  1  5  3  6
2019-11-06  7  2  8  3

In [113]:
#column name added
data_frame = pd.DataFrame(np.random.randint(1,10,size=(6,4)),index = pd.date_range('20191101',periods = 6),columns = ['a','b','c','d'])
data_frame

            a  b  c  d
2019-11-01  4  4  7  3
2019-11-02  6  7  5  1
2019-11-03  2  2  2  2
2019-11-04  4  2  3  9
2019-11-05  2  8  2  8
2019-11-06  4  5  9  9

In [115]:
#Display the index, columns
print(data_frame.index)
print(data_frame.columns)

DatetimeIndex(['2019-11-01', '2019-11-02', '2019-11-03', '2019-11-04',
               '2019-11-05', '2019-11-06'],
              dtype='datetime64[ns]', freq='D')
Index(['a', 'b', 'c', 'd'], dtype='object')

In [116]:
#Display top rows and bottom rows
print(data_frame.head(3)) #first 3 rows
print(data_frame.tail(3)) #last 3 rows

            a  b  c  d
2019-11-01  4  4  7  3
2019-11-02  6  7  5  1
2019-11-03  2  2  2  2
            a  b  c  d
2019-11-04  4  2  3  9
2019-11-05  2  8  2  8
2019-11-06  4  5  9  9

In [118]:
#describe() shows a quick statistic summary of your data
data_frame.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   3.666667  4.666667  4.666667  5.333333
std    1.505545  2.503331  2.875181  3.723797
min    2.000000  2.000000  2.000000  1.000000
25%    2.500000  2.500000  2.250000  2.250000
50%    4.000000  4.500000  4.000000  5.500000
75%    4.000000  6.500000  6.500000  8.750000
max    6.000000  8.000000  9.000000  9.000000